SiriusWolpha/Luminance_Project/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/* GPIO_AD_B0_07 (number 101), UART1_RXD/J17[4] */
/* Routed pin properties */
#define BOARD_INITPINS_UART1_RXD_PERIPHERAL                              LPUART1   /*!< Peripheral name */
#define BOARD_INITPINS_UART1_RXD_SIGNAL                                       RX   /*!< Signal name */

/* GPIO_AD_B0_06 (number 105), UART1_TXD/J17[6] */
/* Routed pin properties */
#define BOARD_INITPINS_UART1_TXD_PERIPHERAL                              LPUART1   /*!< Peripheral name */
#define BOARD_INITPINS_UART1_TXD_SIGNAL                                       TX   /*!< Signal name */

/* GPIO_EMC_36 (number 120), SEMC_D12/U14[48] */
/* Routed pin properties */
#define BOARD_INITPINS_S_DC_PERIPHERAL                                     GPIO3   /*!< Peripheral name */
#define BOARD_INITPINS_S_DC_SIGNAL                                       gpio_io   /*!< Signal name */
#define BOARD_INITPINS_S_DC_CHANNEL                                           4U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_S_DC_GPIO                                           GPIO3   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_S_DC_GPIO_PIN                                          4U   /*!< GPIO pin number */
#define BOARD_INITPINS_S_DC_GPIO_PIN_MASK                             (1U << 4U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_S_DC_PORT                                           GPIO3   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_S_DC_PIN                                               4U   /*!< PORT pin number */
#define BOARD_INITPINS_S_DC_PIN_MASK                                  (1U << 4U)   /*!< PORT pin mask */

/* GPIO_EMC_39 (number 117), SEMC_D15/U14[53] */
/* Routed pin properties */
#define BOARD_INITPINS_S_RESET_PERIPHERAL                                  GPIO3   /*!< Peripheral name */
#define BOARD_INITPINS_S_RESET_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_S_RESET_CHANNEL                                        7U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_S_RESET_GPIO                                        GPIO3   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_S_RESET_GPIO_PIN                                       7U   /*!< GPIO pin number */
#define BOARD_INITPINS_S_RESET_GPIO_PIN_MASK                          (1U << 7U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_S_RESET_PORT                                        GPIO3   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_S_RESET_PIN                                            7U   /*!< PORT pin number */
#define BOARD_INITPINS_S_RESET_PIN_MASK                               (1U << 7U)   /*!< PORT pin mask */

/* GPIO_EMC_34 (number 122), SEMC_D10/U14[45] */
/* Routed pin properties */
#define BOARD_INITPINS_S_MOSI_PERIPHERAL                                  LPSPI4   /*!< Peripheral name */
#define BOARD_INITPINS_S_MOSI_SIGNAL                                         SDO   /*!< Signal name */

/* GPIO_EMC_35 (number 121), SEMC_D11/U14[47] */
/* Routed pin properties */
#define BOARD_INITPINS_S_MISO_PERIPHERAL                                  LPSPI4   /*!< Peripheral name */
#define BOARD_INITPINS_S_MISO_SIGNAL                                         SDI   /*!< Signal name */

/* GPIO_EMC_32 (number 124), SEMC_D8/U14[42] */
/* Routed pin properties */
#define BOARD_INITPINS_S_CLK_PERIPHERAL                                   LPSPI4   /*!< Peripheral name */
#define BOARD_INITPINS_S_CLK_SIGNAL                                          SCK   /*!< Signal name */

/* GPIO_EMC_33 (number 123), SEMC_D9/U14[44] */
/* Routed pin properties */
#define BOARD_INITPINS_S_CS_PERIPHERAL                                    LPSPI4   /*!< Peripheral name */
#define BOARD_INITPINS_S_CS_SIGNAL                                          PCS0   /*!< Signal name */

/* GPIO_EMC_30 (number 126), SEMC_CLK/U14[38] */
/* Routed pin properties */
#define BOARD_INITPINS_S_PENIRQ_PERIPHERAL                                 GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_S_PENIRQ_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_S_PENIRQ_CHANNEL                                      30U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_S_PENIRQ_GPIO                                       GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_S_PENIRQ_GPIO_PIN                                     30U   /*!< GPIO pin number */
#define BOARD_INITPINS_S_PENIRQ_GPIO_PIN_MASK                        (1U << 30U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_S_PENIRQ_PORT                                       GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_S_PENIRQ_PIN                                          30U   /*!< PORT pin number */
#define BOARD_INITPINS_S_PENIRQ_PIN_MASK                             (1U << 30U)   /*!< PORT pin mask */

/* GPIO_EMC_37 (number 119), SEMC_D13/U14[50] */
/* Routed pin properties */
#define BOARD_INITPINS_S_TOUCH_CS_PERIPHERAL                              LPSPI4   /*!< Peripheral name */
#define BOARD_INITPINS_S_TOUCH_CS_SIGNAL                                    PCS2   /*!< Signal name */

/* GPIO_EMC_31 (number 125), SEMC_DM1/U14[39] */
/* Routed pin properties */
#define BOARD_INITPINS_S_LED_PERIPHERAL                                    GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_S_LED_SIGNAL                                      gpio_io   /*!< Signal name */
#define BOARD_INITPINS_S_LED_CHANNEL                                         31U   /*!< Signal channel */

