SiriusWolpha/Luminance_Project/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_S_LED_GPIO                                          GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_S_LED_GPIO_PIN                                        31U   /*!< GPIO pin number */
#define BOARD_INITPINS_S_LED_GPIO_PIN_MASK                           (1U << 31U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_S_LED_PORT                                          GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_S_LED_PIN                                             31U   /*!< PORT pin number */
#define BOARD_INITPINS_S_LED_PIN_MASK                                (1U << 31U)   /*!< PORT pin mask */

/* GPIO_EMC_03 (number 15), SEMC_D3/U14[7] */
/* Routed pin properties */
#define BOARD_INITPINS_SDA_PERIPHERAL                                      GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_SDA_SIGNAL                                        gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SDA_CHANNEL                                            3U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SDA_GPIO                                            GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SDA_GPIO_PIN                                           3U   /*!< GPIO pin number */
#define BOARD_INITPINS_SDA_GPIO_PIN_MASK                              (1U << 3U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_SDA_PORT                                            GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_SDA_PIN                                                3U   /*!< PORT pin number */
#define BOARD_INITPINS_SDA_PIN_MASK                                   (1U << 3U)   /*!< PORT pin mask */

/* GPIO_EMC_02 (number 16), SEMC_D2/U14[5] */
/* Routed pin properties */
#define BOARD_INITPINS_SCL_PERIPHERAL                                      GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_SCL_SIGNAL                                        gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SCL_CHANNEL                                            2U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SCL_GPIO                                            GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SCL_GPIO_PIN                                           2U   /*!< GPIO pin number */
#define BOARD_INITPINS_SCL_GPIO_PIN_MASK                              (1U << 2U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_SCL_PORT                                            GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_SCL_PIN                                                2U   /*!< PORT pin number */
#define BOARD_INITPINS_SCL_PIN_MASK                                   (1U << 2U)   /*!< PORT pin mask */

/* GPIO_EMC_00 (number 18), SEMC_D0/U14[2] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D0_PERIPHERAL                                  GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D0_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D0_CHANNEL                                        0U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SEMC_D0_GPIO                                        GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SEMC_D0_GPIO_PIN                                       0U   /*!< GPIO pin number */
#define BOARD_INITPINS_SEMC_D0_GPIO_PIN_MASK                          (1U << 0U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_SEMC_D0_PORT                                        GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_SEMC_D0_PIN                                            0U   /*!< PORT pin number */
#define BOARD_INITPINS_SEMC_D0_PIN_MASK                               (1U << 0U)   /*!< PORT pin mask */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/* GPIO_AD_B0_15 (number 93), ENET_TXD1/U11[25]/J19[2] */
/* Routed pin properties */
#define BOARD_INITDEBUG_UARTPINS_MyLED_B_PERIPHERAL                        GPIO1   /*!< Peripheral name */
#define BOARD_INITDEBUG_UARTPINS_MyLED_B_SIGNAL                          gpio_io   /*!< Signal name */
#define BOARD_INITDEBUG_UARTPINS_MyLED_B_CHANNEL                             15U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDEBUG_UARTPINS_MyLED_B_GPIO                              GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_MyLED_B_GPIO_PIN                            15U   /*!< GPIO pin number */
#define BOARD_INITDEBUG_UARTPINS_MyLED_B_GPIO_PIN_MASK               (1U << 15U)   /*!< GPIO pin mask */
#define BOARD_INITDEBUG_UARTPINS_MyLED_B_PORT                              GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_MyLED_B_PIN                                 15U   /*!< PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_MyLED_B_PIN_MASK                    (1U << 15U)   /*!< PORT pin mask */

/* GPIO_AD_B0_14 (number 94), ENET_TXD0/U11[24]/J17[7] */
/* Routed pin properties */
#define BOARD_INITDEBUG_UARTPINS_MyLED_G_PERIPHERAL                        GPIO1   /*!< Peripheral name */
#define BOARD_INITDEBUG_UARTPINS_MyLED_G_SIGNAL                          gpio_io   /*!< Signal name */
#define BOARD_INITDEBUG_UARTPINS_MyLED_G_CHANNEL                             14U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDEBUG_UARTPINS_MyLED_G_GPIO                              GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_MyLED_G_GPIO_PIN                            14U   /*!< GPIO pin number */
#define BOARD_INITDEBUG_UARTPINS_MyLED_G_GPIO_PIN_MASK               (1U << 14U)   /*!< GPIO pin mask */
#define BOARD_INITDEBUG_UARTPINS_MyLED_G_PORT                              GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_MyLED_G_PIN                                 14U   /*!< PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_MyLED_G_PIN_MASK                    (1U << 14U)   /*!< PORT pin mask */

/* GPIO_AD_B0_10 (number 98), ENET_RXD0/U11[16]/J19[6] */
/* Routed pin properties */
#define BOARD_INITDEBUG_UARTPINS_MyLED_R_PERIPHERAL                        GPIO1   /*!< Peripheral name */
#define BOARD_INITDEBUG_UARTPINS_MyLED_R_SIGNAL                          gpio_io   /*!< Signal name */
#define BOARD_INITDEBUG_UARTPINS_MyLED_R_CHANNEL                             10U   /*!< Signal channel */

